# Brewfile for automated Mac setup
# Install with: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# CLI Tools
brew "git"
brew "bat"              # Better cat with syntax highlighting
brew "fzf"              # Fuzzy finder
brew "diff-so-fancy"    # Better git diffs
brew "tig"              # Text-mode interface for git
brew "wget"             # Download utility
brew "tree"             # Directory structure viewer
brew "jq"               # JSON processor
brew "ripgrep"          # Better grep
brew "postgresql@15"    # PostgreSQL database
brew "google-cloud-sdk" # Google Cloud Platform CLI

# GUI Applications
cask "google-chrome"
cask "visual-studio-code"
cask "cursor"
cask "figma"
cask "slack"
cask "spotify"
cask "1password"
cask "dropbox"
cask "ghostty"

# Note: Some applications might not be available via Homebrew Cask
# - Zen Browser: Install manually from https://zen-browser.app/download/
# - Spark: Available on Mac App Store
# - ClickUp: May need manual installation from https://clickup.com/download

# Mac App Store applications (requires mas-cli)
brew "mas"
# mas "Xcode", id: 497799835
# mas "Spark", id: 1176895641  # Uncomment if you want automatic installation

